/*************************************************************************************
 * 描    述:  
 * 创 建 者:  czq
 * 创建时间:  2023/5/12
 * ======================================
 * 历史更新记录
 * 版本:V          修改时间:         修改人:
 * 修改内容:
 * ======================================
*************************************************************************************/
namespace DG
{
	public class FPInterpolationCircleOut : FPInterpolation
	{

		public override FP Apply(FP a)
		{
			a -= 1;
			return FPMath.Sqrt(1 - a * a);
		}

	}
}

